package_delivery/app/controllers/news_controller.rb

SELECT "news".* FROM "news"
---
  def CustomerNews
    @news= News.all