package_delivery/app/controllers/pickups_controller.rb

SELECT "pickups".* FROM "pickups"
---
  def index
    @pickups = Pickup.all

DELETE FROM "pickups" WHERE "pickups"."id" = $1  [["id", 980190962]]
---
  def destroy
    @pickup.destroy

SELECT  "pickups".* FROM "pickups" WHERE "pickups"."id" = $1 LIMIT 1  [["id", 980190962]]
---
    def set_pickup
      @pickup = Pickup.find(params[:id])